DataProcessors/ТипПрофиля_ПодготовитьСборкуКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ТипПрофиля_ПодготовитьСборкуКонфигурации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлОписанияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогИсходныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОписанияЗаглушек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пароль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ТипПрофиля_ПодготовитьСборкуКонфигурации/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	ЗапуститьОбработкуПодготовкиСборки();
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ФайлОписанияКонфигурации" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "ФайлОписанияЗаглушек" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогСборки" Тогда
		Возврат Типы.Каталог;
	ИначеЕсли ИмяПараметра = "КаталогИсходныхФайлов" Тогда
		Возврат Типы.Каталог;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапуститьОбработкуПодготовкиСборки()
	
	//Обработка = ВнешниеОбработки.Создать(ПутьКОбработкеПоСборке, Ложь);
	Обработка = Обработки.СборкаКонфигураций.Создать();
	
	ЗаполнитьЗначенияСвойств(Обработка, ЭтотОбъект);
	
	Обработка.ВыполнитьСборкуКонфигурации();
	
КонецФункции

#КонецОбласти
